sdaiInsertNestedAggrByIndexADB(Sdai_Id_aggr*,System.UInt32,Sdai_ADBId*)
\details
Inserts a new nested aggregate value into an application instance list at the position specified by an index.
\param list            [in] An application instance list.
\param index           [in] An index value.
\param selaggrInstance [in] An attribute data block (ADB) object that defines the data type of the value.
\returns The inserted aggregate value.
\remarks
The passed ADB object determines the type of created aggregate in cases when aggregate elements have the SELECT data type.